Applied.

```
➜ terraform apply -var-file=projects/pangeo-hubs.tfvars
Acquiring state lock. This may take a few moments...
data.sops_file.pagerduty_service_integration_keys: Reading...
data.google_compute_subnetwork.default_subnetwork: Reading...
data.google_client_config.default: Reading...
google_service_account.cd_sa: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-cd-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_service_account.workload_sa["coessing"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-coessing@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_service_account.workload_sa["staging"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-staging@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_service_account.workload_sa["prod"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-prod@pangeo-integration-te-3eea.iam.gserviceaccount.com]
data.google_compute_network.default_network: Reading...
google_project_iam_custom_role.requestor_pays: Refreshing state... [id=projects/pangeo-integration-te-3eea/roles/pangeo_hubs_requestor_pays]
google_storage_bucket.user_buckets["coessing-scratch"]: Refreshing state... [id=pangeo-hubs-coessing-scratch]
data.sops_file.pagerduty_service_integration_keys: Read complete after 1s [id=-]
google_storage_bucket.user_buckets["scratch"]: Refreshing state... [id=pangeo-hubs-scratch]
data.google_client_config.default: Read complete after 0s [id=projects/<null>/regions/<null>/zones/<null>]
google_storage_bucket.user_buckets["scratch-staging"]: Refreshing state... [id=pangeo-hubs-scratch-staging]
data.google_compute_network.default_network: Read complete after 1s [id=projects/pangeo-integration-te-3eea/global/networks/default]
google_service_account.cluster_sa: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com]
data.google_container_engine_versions.k8s_version_prefixes["1."]: Reading...
data.google_compute_subnetwork.default_subnetwork: Read complete after 2s [id=projects/pangeo-integration-te-3eea/regions/us-central1/subnetworks/default]
data.google_container_engine_versions.k8s_version_prefixes["1.24."]: Reading...
data.google_container_engine_versions.k8s_version_prefixes["1.26."]: Reading...
data.google_container_engine_versions.k8s_version_prefixes["1.27."]: Reading...
data.google_container_engine_versions.k8s_version_prefixes["1.25."]: Reading...
google_monitoring_notification_channel.pagerduty_disk_space: Refreshing state... [id=projects/pangeo-integration-te-3eea/notificationChannels/5456764498114033028]
google_compute_firewall.iap_ssh_ingress[0]: Refreshing state... [id=projects/pangeo-integration-te-3eea/global/firewalls/allow-ssh]
google_compute_router.router[0]: Refreshing state... [id=projects/pangeo-integration-te-3eea/regions/us-central1/routers/pangeo-hubs-router]
google_filestore_instance.homedirs[0]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/instances/pangeo-hubs-homedirs]
google_service_account_key.cd_sa: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-cd-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com/keys/a49552f97c52549eff834dd54e80865715c0b953]
google_project_iam_member.cd_sa_roles["roles/container.admin"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/container.admin/serviceAccount:pangeo-hubs-cd-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_project_iam_member.cd_sa_roles["roles/artifactregistry.writer"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/artifactregistry.writer/serviceAccount:pangeo-hubs-cd-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_container_cluster.cluster: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster]
google_project_iam_member.cluster_sa_roles["roles/monitoring.metricWriter"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/monitoring.metricWriter/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/artifactregistry.reader"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/artifactregistry.reader/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com]
data.google_container_engine_versions.k8s_version_prefixes["1.25."]: Read complete after 2s [id=2023-11-13 08:48:08.590001 +0000 UTC]
google_project_iam_member.cluster_sa_roles["roles/stackdriver.resourceMetadata.writer"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/stackdriver.resourceMetadata.writer/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_project_iam_member.cluster_sa_roles["roles/logging.logWriter"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/logging.logWriter/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com]
data.google_container_engine_versions.k8s_version_prefixes["1.24."]: Read complete after 2s [id=2023-11-13 08:48:08.963156 +0000 UTC]
google_project_iam_member.cluster_sa_roles["roles/monitoring.viewer"]: Refreshing state... [id=pangeo-integration-te-3eea/roles/monitoring.viewer/serviceAccount:pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_service_account_iam_binding.workload_identity_binding["staging"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-staging@pangeo-integration-te-3eea.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_service_account_iam_binding.workload_identity_binding["prod"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-prod@pangeo-integration-te-3eea.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
data.google_container_engine_versions.k8s_version_prefixes["1.26."]: Read complete after 3s [id=2023-11-13 08:48:10.243184 +0000 UTC]
google_service_account_iam_binding.workload_identity_binding["coessing"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/serviceAccounts/pangeo-hubs-coessing@pangeo-integration-te-3eea.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_storage_bucket_iam_member.member["prod.scratch"]: Refreshing state... [id=b/pangeo-hubs-scratch/roles/storage.admin/serviceAccount:pangeo-hubs-prod@pangeo-integration-te-3eea.iam.gserviceaccount.com]
data.google_container_engine_versions.k8s_version_prefixes["1.27."]: Read complete after 4s [id=2023-11-13 08:48:10.580351 +0000 UTC]
data.google_container_engine_versions.k8s_version_prefixes["1."]: Read complete after 4s [id=2023-11-13 08:48:10.578922 +0000 UTC]
google_storage_bucket_iam_member.member["staging.scratch-staging"]: Refreshing state... [id=b/pangeo-hubs-scratch-staging/roles/storage.admin/serviceAccount:pangeo-hubs-staging@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_storage_bucket_iam_member.member["coessing.coessing-scratch"]: Refreshing state... [id=b/pangeo-hubs-coessing-scratch/roles/storage.admin/serviceAccount:pangeo-hubs-coessing@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_project_iam_member.requestor_pays_binding["prod"]: Refreshing state... [id=pangeo-integration-te-3eea/projects/pangeo-integration-te-3eea/roles/pangeo_hubs_requestor_pays/serviceAccount:pangeo-hubs-prod@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_project_iam_member.requestor_pays_binding["staging"]: Refreshing state... [id=pangeo-integration-te-3eea/projects/pangeo-integration-te-3eea/roles/pangeo_hubs_requestor_pays/serviceAccount:pangeo-hubs-staging@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_project_iam_member.requestor_pays_binding["coessing"]: Refreshing state... [id=pangeo-integration-te-3eea/projects/pangeo-integration-te-3eea/roles/pangeo_hubs_requestor_pays/serviceAccount:pangeo-hubs-coessing@pangeo-integration-te-3eea.iam.gserviceaccount.com]
google_monitoring_alert_policy.disk_space_full_alert: Refreshing state... [id=projects/pangeo-integration-te-3eea/alertPolicies/8187170804504294454]
google_compute_router_nat.nat[0]: Refreshing state... [id=pangeo-integration-te-3eea/us-central1/pangeo-hubs-router/pangeo-hubs-router-nat]
google_container_node_pool.notebook["n2-highmem-64"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-n2-highmem-64]
google_container_node_pool.notebook["small"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-small]
google_container_node_pool.dask_worker["worker"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-worker]
google_container_node_pool.notebook["large"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-large]
google_container_node_pool.notebook["huge"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-huge]
google_container_node_pool.notebook["medium"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-medium]
google_container_node_pool.notebook["n2-highmem-16"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-n2-highmem-16]
google_container_node_pool.notebook["n2-highmem-4"]: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/nb-n2-highmem-4]
google_container_node_pool.core: Refreshing state... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/core-pool]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        id                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster"
      ~ min_master_version          = "1.26.5-gke.2100" -> "1.27.5-gke.200"
        name                        = "pangeo-hubs-cluster"
        # (29 unchanged attributes hidden)

        # (28 unchanged blocks hidden)
    }

  # google_container_node_pool.core must be replaced
-/+ resource "google_container_node_pool" "core" {
      ~ id                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/core-pool" -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroupManagers/gke-pangeo-hubs-cluster-core-pool-c8492309-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroups/gke-pangeo-hubs-cluster-core-pool-c8492309-grp",
        ] -> (known after apply)
      ~ max_pods_per_node           = 110 -> (known after apply)
        name                        = "core-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 1 -> (known after apply)
      ~ node_locations              = [
          - "us-central1-b",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.26.4-gke.1400" -> "1.27.5-gke.200"
        # (4 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "BALANCED" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
          - pod_ipv4_cidr_block  = "10.8.0.0/14" -> null
          - pod_range            = "gke-pangeo-hubs-cluster-pods-14554e9f" -> null
        }

      ~ node_config {
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n2-highmem-8" -> "n2-highmem-4" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
            tags              = []
          ~ taint             = [] -> (known after apply)
            # (9 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }

        # (1 unchanged block hidden)
    }

  # google_container_node_pool.dask_worker["n2-highmem-16"] will be created
  + resource "google_container_node_pool" "dask_worker" {
      + cluster                     = "pangeo-hubs-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 0
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1-b"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "dask-n2-highmem-16"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "pangeo-integration-te-3eea"
      + version                     = "1.27.5-gke.200"

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 100
          + min_node_count  = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = false
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = "pd-balanced"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "k8s.dask.org/node-purpose" = "worker"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n2-highmem-16"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + resource_labels   = {
              + "node-purpose" = "dask-worker"
            }
          + service_account   = "pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com"
          + spot              = false
          + tags              = []
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "k8s.dask.org_dedicated"
                  + value  = "worker"
                },
            ]

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }
    }

  # google_container_node_pool.dask_worker["worker"] will be destroyed
  # (because key ["worker"] is not in for_each map)
  - resource "google_container_node_pool" "dask_worker" {
      - cluster                     = "pangeo-hubs-cluster" -> null
      - id                          = "projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-worker" -> null
      - initial_node_count          = 0 -> null
      - instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroupManagers/gke-pangeo-hubs-cluster-dask-worker-e9e6eead-grp",
        ] -> null
      - location                    = "us-central1-b" -> null
      - managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/pangeo-integration-te-3eea/zones/us-central1-b/instanceGroups/gke-pangeo-hubs-cluster-dask-worker-e9e6eead-grp",
        ] -> null
      - max_pods_per_node           = 110 -> null
      - name                        = "dask-worker" -> null
      - node_count                  = 0 -> null
      - node_locations              = [
          - "us-central1-b",
        ] -> null
      - project                     = "pangeo-integration-te-3eea" -> null
      - version                     = "1.26.4-gke.1400" -> null

      - autoscaling {
          - location_policy      = "ANY" -> null
          - max_node_count       = 100 -> null
          - min_node_count       = 0 -> null
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = false -> null
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
          - pod_ipv4_cidr_block  = "10.8.0.0/14" -> null
          - pod_range            = "gke-pangeo-hubs-cluster-pods-14554e9f" -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-balanced" -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {
              - "k8s.dask.org/node-purpose" = "worker"
            } -> null
          - local_ssd_count   = 0 -> null
          - logging_variant   = "DEFAULT" -> null
          - machine_type      = "n2-highmem-16" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible       = true -> null
          - resource_labels   = {
              - "node-purpose" = "dask-worker"
            } -> null
          - service_account   = "pangeo-hubs-cluster-sa@pangeo-integration-te-3eea.iam.gserviceaccount.com" -> null
          - spot              = false -> null
          - tags              = [] -> null
          - taint             = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "k8s.dask.org_dedicated"
                  - value  = "worker"
                },
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Do you want to perform these actions in workspace "pangeo-hubs"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_container_node_pool.core: Destroying... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/core-pool]
google_container_node_pool.dask_worker["worker"]: Destroying... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-worker]
google_container_node_pool.dask_worker["worker"]: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...geo-hubs-cluster/nodePools/dask-worker, 10s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 10s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 20s elapsed]
google_container_node_pool.dask_worker["worker"]: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...geo-hubs-cluster/nodePools/dask-worker, 20s elapsed]
google_container_node_pool.dask_worker["worker"]: Destruction complete after 26s
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 30s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 40s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 50s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 1m0s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 1m10s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 1m20s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 1m30s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 1m40s elapsed]

google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 1m50s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 2m0s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 2m10s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 2m20s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 2m30s elapsed]
google_container_node_pool.core: Still destroying... [id=projects/pangeo-integration-te-3eea/loc...angeo-hubs-cluster/nodePools/core-pool, 2m40s elapsed]
google_container_node_pool.core: Destruction complete after 2m41s
google_container_cluster.cluster: Modifying... [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster]

google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 10s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 20s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 30s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 40s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 50s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 1m0s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 1m10s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 1m20s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 1m30s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 1m40s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 1m50s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 2m0s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 2m10s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 2m20s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 2m30s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 2m40s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 2m50s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 3m0s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 3m10s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 3m20s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 3m30s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 3m40s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 3m50s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 4m0s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 4m10s elapsed]
google_container_cluster.cluster: Still modifying... [id=projects/pangeo-integration-te-3eea/loc...entral1-b/clusters/pangeo-hubs-cluster, 4m20s elapsed]
google_container_cluster.cluster: Modifications complete after 4m25s [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster]
google_container_node_pool.dask_worker["n2-highmem-16"]: Creating...
google_container_node_pool.core: Creating...
google_container_node_pool.core: Still creating... [10s elapsed]
google_container_node_pool.dask_worker["n2-highmem-16"]: Still creating... [10s elapsed]
google_container_node_pool.core: Still creating... [20s elapsed]
google_container_node_pool.dask_worker["n2-highmem-16"]: Still creating... [20s elapsed]
google_container_node_pool.dask_worker["n2-highmem-16"]: Still creating... [30s elapsed]
google_container_node_pool.core: Still creating... [30s elapsed]
google_container_node_pool.dask_worker["n2-highmem-16"]: Creation complete after 37s [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/dask-n2-highmem-16]
google_container_node_pool.core: Still creating... [40s elapsed]
google_container_node_pool.core: Still creating... [50s elapsed]
google_container_node_pool.core: Still creating... [1m0s elapsed]
google_container_node_pool.core: Still creating... [1m10s elapsed]
google_container_node_pool.core: Still creating... [1m20s elapsed]
google_container_node_pool.core: Creation complete after 1m29s [id=projects/pangeo-integration-te-3eea/locations/us-central1-b/clusters/pangeo-hubs-cluster/nodePools/core-pool]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 1 changed, 2 destroyed.

Outputs:

buckets = {
  "coessing-scratch" = "pangeo-hubs-coessing-scratch"
  "scratch" = "pangeo-hubs-scratch"
  "scratch-staging" = "pangeo-hubs-scratch-staging"
}
ci_deployer_key = <sensitive>
kubernetes_sa_annotations = {
  "coessing" = "iam.gke.io/gcp-service-account: pangeo-hubs-coessing@pangeo-integration-te-3eea.iam.gserviceaccount.com"
  "prod" = "iam.gke.io/gcp-service-account: pangeo-hubs-prod@pangeo-integration-te-3eea.iam.gserviceaccount.com"
  "staging" = "iam.gke.io/gcp-service-account: pangeo-hubs-staging@pangeo-integration-te-3eea.iam.gserviceaccount.com"
}
registry_sa_keys = <sensitive>
regular_channel_latest_k8s_versions = {
  "1." = "1.27.5-gke.200"
  "1.24." = "1.24.17-gke.200"
  "1.25." = "1.25.13-gke.200"
  "1.26." = "1.26.8-gke.200"
  "1.27." = "1.27.5-gke.200"
}
```